/* Дан массив [16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

1. Найти сумму и количество положительных элементов.

2. Найти минимальный элемент массива и его порядковый номер.

3. Найти максимальный элемент массива и его порядковый номер.

4. Определить количество отрицательных элементов.

5. Найти количество нечетных положительных элементов.

6. Найти количество четных положительных элементов.

7. Найти сумму четных положительных элементов.

8. Найти сумму нечетных положительных элементов.

9. Найти произведение положительных элементов.

10. Найти определить количество элементов, равных 4.

11. Найти наибольший среди элементов массива, остальные обнулить.

Взять еще один массив [46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47,16,-37,54,-4,72,-56,47,4,-16,25,-37]

13. Вычислить разность соответствующих элементов массивов и записать в новый массив [-30, -41, 105...].*/


//1. Найти сумму и количество положительных элементов

let basicArr = [16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4, 47];
let positNumbers = 0;//змінна куди записуватимуться додатні значення
let sumPositNumbers = 0;//змінна у якій сумуватимуться додатні значення

for (i = 0; i < basicArr.length; i++) {
    if (basicArr[i] > 0) {
        sumPositNumbers += basicArr[i];
        positNumbers++;
    }
}

console.log(`
1. Найти сумму и количество положительных элементов
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Сума додатних елементів масиву складає ${sumPositNumbers}.
У масиві ${positNumbers} додатних елементів.
`);

//2. Найти минимальный элемент массива и его порядковый номер.

let leastElementBasicArr = basicArr[0];// змінна у яку перезаписуватимуться найменші значення

for (i = 0; i < basicArr.length; i++) {
    if (leastElementBasicArr > basicArr[i]) {
        leastElementBasicArr = basicArr[i];
    }
}

console.log(`
2. Найти минимальный элемент массива и его порядковый номер.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Мінімальним елементом масиву є ${leastElementBasicArr}.
Його порядковим номером є ${basicArr.indexOf(leastElementBasicArr)}.
`);

//3. Найти максимальный элемент массива и его порядковый номер.

let biggestElementBasicArr = basicArr[0];// змінна у яку перезаписуватимуться найбільші значення

for (i = 0; i < basicArr.length; i++) {
    if (biggestElementBasicArr < basicArr[i]) {
        biggestElementBasicArr = basicArr[i];
    }
}

console.log(`
3. Найти максимальный элемент массива и его порядковый номер.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Максимальним елементом масиву є ${biggestElementBasicArr}.
Його порядковим номером є ${basicArr.indexOf(biggestElementBasicArr)}.
`);

//4. Определить количество отрицательных элементов.

let negatNumbers = 0;//змінна куди записуватимуться від'ємні значення

for (i = 0; i < basicArr.length; i++) {
    if (basicArr[i] < 0) {
        negatNumbers++;
    }
}

console.log(`
4. Определить количество отрицательных элементов.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

У масиві ${negatNumbers} від'ємних елементів.
`);

//5. Найти количество нечетных положительных элементов.

let oddPositNumbers = 0;// змінна для непарних додатних елементів

for (i = 0; i < basicArr.length; i++) {
    if ((basicArr[i] > 0) && (basicArr[i] % 2 == 1)) {
        oddPositNumbers++;
    }
}

console.log(`
5. Найти количество нечетных положительных элементов.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

У масиві ${oddPositNumbers} непарних додатних елемента.
`);

//6. Найти количество четных положительных элементов.

let evenPositNumbers = 0;// змінна для парних додатних елементів

for (i = 0; i < basicArr.length; i++) {
    if ((basicArr[i] > 0) && (basicArr[i] % 2 == 0)) {
        evenPositNumbers++;
    }
}

console.log(`
6. Найти количество четных положительных элементов.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

У масиві ${evenPositNumbers} парних додатних елементів.
`);

//7. Найти сумму четных положительных элементов.

let sumEvenPositNumbers = 0;//змінна у якій сумуватимуться парні додатні значення

for (i = 0; i < basicArr.length; i++) {
    if ((basicArr[i] > 0) && (basicArr[i] % 2 == 0)) {
        sumEvenPositNumbers += basicArr[i];
    }
}

console.log(`
7. Найти сумму четных положительных элементов.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Сума парних додатних елементів масиву складає ${sumEvenPositNumbers}
`);

//8. Найти сумму нечетных положительных элементов.

let sumOddPositNumbers = 0;//змінна у якій сумуватимуться непарні додатні значення

for (i = 0; i < basicArr.length; i++) {
    if ((basicArr[i] > 0) && (basicArr[i] % 2 == 1)) {
        sumOddPositNumbers += basicArr[i];
    }
}

console.log(`
8. Найти сумму нечетных положительных элементов.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Сума непарних додатних елементів масиву складає ${sumOddPositNumbers}
`);

//9. Найти произведение положительных элементов.

let productPositNumbers = 1;//змінна у якій зберігатиметься добуток додатних елементів

for (i = 0; i < basicArr.length; i++) {
    if (positNumbers == 0) {//перевірка на випадок відсутності додатних елементів
        productPositNumbers = 0;
        break;
    } else if (basicArr[i] > 0) {
        productPositNumbers *= basicArr[i];
    }
}

console.log(`
9. Найти произведение положительных элементов.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Добуток додатних елементів масиву складає ${productPositNumbers}
`);

//10. Найти определить количество элементов, равных 4.

let foursNumber = 0;//змінна куди записуватимуться значення рівні 4

for (i = 0; i < basicArr.length; i++) {
    if (basicArr[i] === 4) {
        foursNumber++;
    }
}

console.log(`
10. Найти определить количество элементов, равных 4.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

У масиві ${foursNumber} елемента рівніх 4.
`);

//11. Найти наибольший среди элементов массива, остальные обнулить.

let maxElementBasicArr = basicArr[0];// змінна у якій перезаписуватиметься найбільше значення

for (i = 0; i < basicArr.length; i++) {
    if (maxElementBasicArr < basicArr[i]) {
        maxElementBasicArr = basicArr[i];
    } 
}

for (i = 0; i < basicArr.length; i++) {
    if (basicArr [i] != maxElementBasicArr) {
        basicArr [i] = 0;
    }
}

console.log(`
11. Найти наибольший среди элементов массива, остальные обнулить.
[16,-37,54,-4,72,-56,47,4,-16,25,-37,46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47]

Найбільшим елементом масиву є ${maxElementBasicArr}. Обнулений масив:
[${basicArr}]
`)

//Взять еще один массив [46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47,16,-37,54,-4,72,-56,47,4,-16,25,-37]
//13. Вычислить разность соответствующих элементов массивов и записать в новый массив [-30, -41, 105...].

oldArr = [16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37, 46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4, 47];
newArr = [46, 4, -51, 27, -63, 4, -54, 76, -4, 12, -35, 4, 47, 16, -37, 54, -4, 72, -56, 47, 4, -16, 25, -37];
arrayDifference = [];

for (i = 0; i < oldArr.length; i++) {
    arrayDifference[i] = oldArr[i] - newArr[i];
}

console.log(`
Взять еще один массив [46,4,-51,27,-63,4,-54,76,-4,12,-35,4,47,16,-37,54,-4,72,-56,47,4,-16,25,-37]
13. Вычислить разность соответствующих элементов массивов и записать в новый массив [-30, -41, 105...].

Новий масив [${arrayDifference}]`)